[
  {
    "id": 1,
    "name": "Snake Plant",
    "category": "Air Purifier",
    "price": 180,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Snake Plant, also known as Mother-in-Law’s Tongue, is one of the easiest indoor plants to care for. It thrives in low light, tolerates neglect, and naturally filters toxins from the air. Its upright, sword-shaped leaves make it an ideal plant for both modern and traditional homes.",
    "image": "https://i.ibb.co.com/Y7HqHY7b/images.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "id": 2,
    "name": "Peace Lily",
    "category": "Flowering",
    "price": 220,
    "rating": 4.7,
    "availableStock": 8,
    "careLevel": "Medium",
    "description": "The Peace Lily is a graceful indoor plant famous for its elegant white blooms and deep green leaves. It helps purify indoor air and thrives in indirect sunlight. Regular watering and occasional misting will keep this beauty blooming all year round.",
    "image": "https://i.ibb.co.com/9M4VrVL/peace-lily-plant-2.jpg",
    "providerName": "BloomNest"
  },
  {
    "id": 3,
    "name": "Spider Plant",
    "category": "Air Purifier",
    "price": 150,
    "rating": 4.6,
    "availableStock": 12,
    "careLevel": "Easy",
    "description": "Spider Plants are fast-growing, resilient, and perfect for beginners. Their arching green and white striped leaves look beautiful in hanging baskets. They effectively remove indoor pollutants and thrive in bright, indirect light with occasional watering.",
    "image": "https://i.ibb.co.com/1fSYRs9s/images-1.jpg",
    "providerName": "GreenAura"
  },
  {
    "id": 4,
    "name": "Aloe Vera",
    "category": "Succulent",
    "price": 200,
    "rating": 4.9,
    "availableStock": 15,
    "careLevel": "Easy",
    "description": "Aloe Vera is not only a popular succulent but also a natural healer. Its thick, fleshy leaves store water and contain soothing gel used for burns and skin care. It requires minimal watering and bright light, making it a perfect low-maintenance plant for busy plant lovers.",
    "image": "https://i.ibb.co.com/mFRLxTR8/images-2.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "id": 5,
    "name": "ZZ Plant",
    "category": "Low Light",
    "price": 250,
    "rating": 4.8,
    "availableStock": 9,
    "careLevel": "Easy",
    "description": "The ZZ Plant is a resilient and elegant indoor plant known for its glossy, dark green leaves. It can survive with very little water and low light, making it ideal for offices and apartments. This plant adds a luxurious touch while demanding minimal attention.",
    "image": "https://i.ibb.co.com/yFp0Rqrf/images-3.jpg",
    "providerName": "LeafyHaven"
  },
  {
    "id": 6,
    "name": "Monstera Deliciosa",
    "category": "Tropical",
    "price": 350,
    "rating": 4.9,
    "availableStock": 6,
    "careLevel": "Medium",
    "description": "Monstera Deliciosa, also called the Swiss Cheese Plant, is a tropical favorite known for its large, perforated leaves. It thrives in bright, indirect light and high humidity. With its bold and exotic look, Monstera instantly transforms any living space into a lush indoor jungle.",
    "image": "https://i.ibb.co.com/Gv5ZQzch/monstera-deliciosa-monster-fruit-exotic-green-fruit-2-XPFPNC.jpg",
    "providerName": "TropicHouse"
  },
  {
    "id": 7,
    "name": "Pothos",
    "category": "Vine",
    "price": 160,
    "rating": 4.7,
    "availableStock": 14,
    "careLevel": "Easy",
    "description": "Pothos, often called Devil’s Ivy, is a fast-growing vine that can adapt to a wide range of conditions. It’s ideal for hanging planters and shelves, where its long green tendrils can cascade beautifully. Pothos thrives in both low and bright light and requires very little care.",
    "image": "https://i.ibb.co.com/xKC0QgTK/images-4.jpg",
    "providerName": "BloomNest"
  },
  {
    "id": 8,
    "name": "Fiddle Leaf Fig",
    "category": "Decorative",
    "price": 450,
    "rating": 4.5,
    "availableStock": 5,
    "careLevel": "Hard",
    "description": "The Fiddle Leaf Fig is a dramatic and stylish plant with large, glossy violin-shaped leaves. It’s a favorite among interior designers for its bold aesthetic. It needs bright, indirect sunlight and consistent watering to stay healthy, making it ideal for experienced plant owners.",
    "image": "https://i.ibb.co.com/ycx1dB2Q/fiddle-leaf-fig-tree-xxl.jpg",
    "providerName": "LeafyHaven"
  },
  {
    "id": 9,
    "name": "Rubber Plant",
    "category": "Decorative",
    "price": 280,
    "rating": 4.8,
    "availableStock": 7,
    "careLevel": "Medium",
    "description": "The Rubber Plant features bold, glossy leaves that add structure and style to any room. It prefers moderate light and occasional watering. Its air-purifying ability and dramatic foliage make it an excellent centerpiece for home or office spaces.",
    "image": "https://i.ibb.co.com/hTBdXdK/images-5.jpg",
    "providerName": "GreenAura"
  },
  {
    "id": 10,
    "name": "Lavender",
    "category": "Aromatic",
    "price": 190,
    "rating": 4.6,
    "availableStock": 11,
    "careLevel": "Medium",
    "description": "Lavender is a fragrant herb loved for its soothing aroma and delicate purple blooms. It thrives in bright sunlight and well-drained soil. Beyond its beauty, Lavender is known for reducing stress and promoting better sleep, making it both decorative and therapeutic.",
    "image": "https://i.ibb.co.com/M5krSL0M/images-6.jpg",
    "providerName": "TropicHouse"
  },
  {
    "id": 11,
    "name": "Bamboo Palm",
    "category": "Air Purifier",
    "price": 300,
    "rating": 4.8,
    "availableStock": 9,
    "careLevel": "Easy",
    "description": "The Bamboo Palm is a graceful and elegant plant that adds a tropical touch indoors. It efficiently removes harmful toxins from the air and thrives in low to medium light. Its lush green fronds create a calm and relaxing atmosphere in any living area.",
    "image": "https://i.ibb.co.com/B5F06WQb/images-7.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "id": 12,
    "name": "Jade Plant",
    "category": "Succulent",
    "price": 170,
    "rating": 4.7,
    "availableStock": 13,
    "careLevel": "Easy",
    "description": "The Jade Plant, also known as the Money Plant, is a symbol of good luck and prosperity. Its thick, glossy leaves store water, allowing it to survive in dry conditions. Easy to care for and long-lasting, this plant is perfect for both beginners and collectors alike.",
    "image": "https://i.ibb.co.com/5gz7g59H/images-8.jpg",
    "providerName": "BloomNest"
  }
]
